# More Data Preprocessing (with Pandas)

Pandas is a very useful data analytics package within Python.

Let's start with some random data.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df

        one       two     three
a  1.033865 -0.181208  0.090528
c  0.263908 -0.600121 -1.350119
e -0.512211 -0.622430 -1.168213
f -1.028863 -0.244961 -0.504402
h  1.862596 -1.167164 -1.022990

We know with Pandas we can mix & match data types, so let us add two more columns, named 'four' and 'five':

In [3]:
df['four'] = 'bar'
df['five'] = df['one'] > 0
df

        one       two     three four   five
a  1.033865 -0.181208  0.090528  bar   True
c  0.263908 -0.600121 -1.350119  bar   True
e -0.512211 -0.622430 -1.168213  bar  False
f -1.028863 -0.244961 -0.504402  bar  False
h  1.862596 -1.167164 -1.022990  bar   True

Adding new rows is also simple. Below we include three extra empty rows:

In [4]:
df2 = df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df2

        one       two     three four   five
a  1.033865 -0.181208  0.090528  bar   True
b       NaN       NaN       NaN  NaN    NaN
c  0.263908 -0.600121 -1.350119  bar   True
d       NaN       NaN       NaN  NaN    NaN
e -0.512211 -0.622430 -1.168213  bar  False
f -1.028863 -0.244961 -0.504402  bar  False
g       NaN       NaN       NaN  NaN    NaN
h  1.862596 -1.167164 -1.022990  bar   True

# Your Turn Here

Do you still remember how to index a row/column?

In [8]:
#### index row 'c' below
df2.loc['c']

one      0.263908
two     -0.600121
three    -1.35012
four          bar
five         True
Name: c, dtype: object

In [10]:
#### index column 'two' below
df2.two

a   -0.181208
b         NaN
c   -0.600121
d         NaN
e   -0.622430
f   -0.244961
g         NaN
h   -1.167164
Name: two, dtype: float64

pandas has two functions isnull() and notnull() that return boolean objects when called.

In [11]:
pd.isnull(df2['one'])

a    False
b     True
c    False
d     True
e    False
f    False
g     True
h    False
Name: one, dtype: bool

In [12]:
pd.notnull(df2['one'])

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

Missing values propagate naturally through arithmetic operations between pandas objects.

In [13]:
a = df[['one','two']]
a['one']['a':'e'] = float('nan')
a

/opt/tljh/user/lib/python3.6/site-packages/pandas/core/series.py:935: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._set_with(key, value)
/opt/tljh/user/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2963: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  exec(code_obj, self.user_global_ns, self.user_ns)

        one       two
a       NaN -0.181208
c       NaN -0.600121
e       NaN -0.622430
f -1.028863 -0.244961
h  1.862596 -1.167164

In [14]:
b = df[['one','two','three']]
b

        one       two     three
a  1.033865 -0.181208  0.090528
c  0.263908 -0.600121 -1.350119
e -0.512211 -0.622430 -1.168213
f -1.028863 -0.244961 -0.504402
h  1.862596 -1.167164 -1.022990

In [15]:
a + b

        one  three       two
a       NaN    NaN -0.362417
c       NaN    NaN -1.200241
e       NaN    NaN -1.244860
f -2.057727    NaN -0.489923
h  3.725191    NaN -2.334329

In [16]:
b + a

        one  three       two
a       NaN    NaN -0.362417
c       NaN    NaN -1.200241
e       NaN    NaN -1.244860
f -2.057727    NaN -0.489923
h  3.725191    NaN -2.334329

# How to deal with Missing Values

## Deleting Missing Values

The simplest method is always dropping all missing values - but it is highly **discouraged!!!**

In [17]:
a['one'].dropna()

f   -1.028863
h    1.862596
Name: one, dtype: float64

By default, dropna() will drop any row containing **NaN** values, but you can change that by using the *axis=* and *thresh=* arguments.

**NOTE**: Dropping rows or columns have different uses.

In [18]:
#### This statement drop any column with NaN values
a.dropna(axis=1)

        two
a -0.181208
c -0.600121
e -0.622430
f -0.244961
h -1.167164

In [19]:
#### thresh determines how many non-NaN values a column/row should have without being dropped
c = a + b
c.dropna(axis=1, thresh=2)

        one       two
a       NaN -0.362417
c       NaN -1.200241
e       NaN -1.244860
f -2.057727 -0.489923
h  3.725191 -2.334329

You can also use the *how=* argument to determine how do you want to remove the NaN values.

In [20]:
#### By default, dropna() drops column/row with any NaN values
#### how = 'all' changes that to dropping column/row with all NaN values
c.dropna(axis=1, how='all')

        one       two
a       NaN -0.362417
c       NaN -1.200241
e       NaN -1.244860
f -2.057727 -0.489923
h  3.725191 -2.334329

You can refer to the [pandas.dropna() docs](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.dropna.html) for more information.

## Imputing Missing Values

Imputing means filling missing values - you can do that when the missing and non-missing values are in some type of relationship.

In [21]:
my_series = pd.Series([1, np.nan, 2, None, 3], index=list('abcde'))
my_series

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [22]:
#### you can fill missing values with a specific value (0)
my_series.fillna(0)

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

Alternatively, we can specify a forward-fill to propagate the previous value forward:

In [23]:
# forward-fill
my_series.fillna(method='ffill')

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

Or we can specify a back-fill to propagate the next values backward:

In [24]:
my_series.fillna(method='bfill')

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

## Your Turn Here
Aforementioned method can be applied to dataframes.

In [25]:
#### Let us generate a random dataframe
rand_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['one', 'two', 'three'])
rand_df = rand_df.mask(np.random.random(rand_df.shape) < .3)
rand_df

        one       two     three
a -0.175739       NaN       NaN
b  1.221203  0.413439  1.000016
c       NaN -1.615427 -2.365465
d -0.129623 -0.364541       NaN
e  0.657617 -0.489526 -1.289377

Your tasks are as follows:

- fill missing values in column **one** with value 1;
- fill missing values in column **two** with forward-filling;
- fill missing values in column **three** with backward-filling.

In [30]:
#### insert your code here
rand_df.one.fillna(1)
rand_df.two.fillna(method='ffill')
rand_df.three.fillna(method='bfill')

a    1.000016
b    1.000016
c   -2.365465
d   -1.289377
e   -1.289377
Name: three, dtype: float64

A useful approach for imputing your missing data is to use mean/mode to replace missing data - the reason behind this logic is that if we are going to *guess* the values of the missing data, the highest chance would be guessing it to be the mean/mode if the data follows **normal** distribution.

In [31]:
#### let us generate another DF
my_df = pd.DataFrame(np.random.randn(5, 3), 
                  index=['a', 'b', 'c', 'd', 'e'],
                  columns=['A', 'B', 'C'])
my_df = my_df.mask(np.random.random(my_df.shape) < .3)
my_df

          A         B         C
a -0.117399 -0.042325       NaN
b  0.639709       NaN       NaN
c -0.508001 -1.538222       NaN
d  0.101657 -0.005265 -0.373859
e  0.442629       NaN       NaN

In [32]:
#### Let us check if there is any missing value in the df
my_df.isnull().values.any()

True

In [33]:
#### Then we are getting the mean of the DF
#### Note that since we only 
my_df.mean()

A    0.111719
B   -0.528604
C   -0.373859
dtype: float64

In [34]:
df_filled = my_df.fillna(my_df.mean())
df_filled

          A         B         C
a -0.117399 -0.042325 -0.373859
b  0.639709 -0.528604 -0.373859
c -0.508001 -1.538222 -0.373859
d  0.101657 -0.005265 -0.373859
e  0.442629 -0.528604 -0.373859

In [35]:
#### Now let us check again if there is any missing values
df_filled.isnull().values.any()

False

More info regarding how to handle missing data can be found [here](https://machinelearningmastery.com/handle-missing-data-python/).

# Other Tasks in Data Preprocessing

- Handling categorical data (coding)
- Handling imbalanced data
- feature engineering

These topics will be covered in later part of this class.